[
  {
    "url": "http://arxiv.org/abs/2411.10383",
    "title": "Framework for Co-distillation Driven Federated Learning to Address Class Imbalance in Healthcare",
    "japanese_title": "医療におけるクラス不均衡に対処する共蒸留駆動の連合学習フレームワーク",
    "authors": [
      "Suraj Racha",
      "Shubh Gupta",
      "Humaira Firdowse",
      "Aastik Solanki",
      "Ganesh Ramakrishnan",
      "Kshitij S. Jadhav"
    ],
    "categories": [
      "cs.LG"
    ],
    "comment": "Accepted at CODS COMAD'24 and to be published in the Discover Data   Journal(https://link.springer.com/journal/44248)",
    "summary": "- 連合学習は複数クライアント間でモデルを協力的にトレーニングしデータプライバシーを保護する。\n- 医療におけるクラス不均衡は大きな課題で、特に病院がクライアントとして医療画像を共有する際に顕著。\n- 共蒸留駆動フレームワークを提案し、クライアント間の知識共有を促進して学習成果を向上。\n- 実験でクラス不均衡を扱う際に他の手法を凌ぎ、標準偏差も最も少なくロバスト性が確認された。\n\n面白いね～！このフレームワークが普及したら、病院同士でのデータ共有がもっと効果的になって、医療技術の進歩につながりそう！みんなの健康がもっと守られちゃう予感！",
    "topics": [
      "連合学習"
    ],
    "published": "2024-11-15T17:46:42+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.10377",
    "title": "Generation of synthetic gait data: application to multiple sclerosis patients' gait patterns",
    "japanese_title": "合成歩行データの生成：多発性硬化症患者の歩行パターンへの応用",
    "authors": [
      "Klervi Le Gall",
      "Lise Bellanger",
      "David Laplaud"
    ],
    "categories": [
      "cs.CV",
      "stat.AP"
    ],
    "comment": "",
    "summary": "- 多発性硬化症は若年成人の非外傷性の重度障害の主な原因で、発生率が増加中\n- QTSデータを任意の合成データ生成方法に適用可能に変換する包括的フレームワークを提案\n- 近傍重み付けに基づく高精度の合成QTSデータ生成法を紹介、特に小規模データセットに適している\n- 提案手法の効果をMSの歩行データに適用し、データの初期幾何を尊重した優れた忠実度を示した\n\nこの論文って、合成データで実験が安全にできちゃうってことかな？すっごいね！どんどん新しい治療法とかデータ分析法が見つかりそうでワクワクするね！",
    "topics": [
      "合成データ"
    ],
    "published": "2024-11-15T17:32:01+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.10255",
    "title": "Artificial Intelligence in Pediatric Echocardiography: Exploring Challenges, Opportunities, and Clinical Applications with Explainable AI and Federated Learning",
    "japanese_title": "小児心エコー検査における人工知能: 説明可能なAIと連合学習による課題、機会、臨床応用の探究",
    "authors": [
      "Mohammed Yaseen Jabarulla",
      "Theodor Uden",
      "Thomas Jack",
      "Philipp Beerbaum",
      "Steffen Oeltze-Jafra"
    ],
    "categories": [
      "cs.AI"
    ],
    "comment": "This article is planned for submission to Frontiers Journal",
    "summary": "- 小児心疾患のAI解析にはデータの限界やプライバシー、モデルの透明性が課題である\n- 説明可能AIと連合学習により自動診断と意思決定支援の改善を目指す\n- 研究は小児心エコーにおけるAIの制限と機会を検証し、未来の発展や研究のギャップを探る\n- 視点認識、疾患分類、心臓構造のセグメンテーション、機能評価の4つの臨床ケースを示す\n\n小児向けのAIってなんか不思議な響きで面白い！未来の医療がもっと手軽になっちゃったりしてって想像したらワクワクするよね。一緒にこんな研究の話をもっと知りたくなっちゃうね！",
    "topics": [
      "連合学習"
    ],
    "published": "2024-11-15T15:03:34+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.10212",
    "title": "Embedding Byzantine Fault Tolerance into Federated Learning via Virtual Data-Driven Consistency Scoring Plugin",
    "japanese_title": "連合学習にビザンチン耐性を組み込むための仮想データ駆動型一貫性スコアリングプラグイン",
    "authors": [
      "Youngjoon Lee",
      "Jinu Gong",
      "Joonhyuk Kang"
    ],
    "categories": [
      "cs.LG"
    ],
    "comment": "7 pages",
    "summary": "- 連合学習はプライベートデータを送信せずにモデルを学習するが、ビザンチン攻撃に脆弱である\n- 提案プラグインは仮想データを生成しモデル一貫性スコアを用いて不正デバイスを排除する\n- スコアリング機構により、既存技術にビザンチン耐性を持たせ利益を維持しつつ頑健化する\n- 医療画像分類での結果は、提案方法が効果的なビザンチン耐性を実現することを示している\n\nビザンチン攻撃に対抗するプラグインが生まれるなんて、なんだかヒーローみたい！医療画像分類での有効性も実証済みだし、未来のAIはますます安全で強くなっていく予感がするね。技術がどんどん進化していくのが楽しい！",
    "topics": [
      "連合学習"
    ],
    "published": "2024-11-15T14:17:19+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.10164",
    "title": "Evaluating Text-to-Image Diffusion Models for Texturing Synthetic Data",
    "japanese_title": "テキストから画像への拡散モデルを用いた合成データのテクスチャ評価",
    "authors": [
      "Thomas Lips",
      "Francis wyffels"
    ],
    "categories": [
      "cs.RO"
    ],
    "comment": "Submitted to RA-L",
    "summary": "- 大量の実データを集めるのが難しいロボット操作システム構築に合成データが有望な代替手段\n- プリトレイン済のテキストから画像拡散モデルを使ったテクスチャとランダムテクスチャを比較\n- ロボット操作に重要なオブジェクト中心の表現生成において拡散モデルはランダムと同等の性能\n- 今のところ拡散モデルを使ったテクスチャリングは、ロボット学習用合成データ生成にメリットがない\n\n拡散モデルってテクスチャづけに夢があると思ってたけど、まだまだ工夫が必要みたいね。でも、これからの進化が楽しみだし、違った活用法も見つかるかもしれないよね！",
    "topics": [
      "合成データ"
    ],
    "published": "2024-11-15T13:12:47+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.10156",
    "title": "Mitigating Sycophancy in Decoder-Only Transformer Architectures: Synthetic Data Intervention",
    "japanese_title": "デコーダーオンリー変換器アーキテクチャにおける忖度軽減：合成データ介入",
    "authors": [
      "Libo Wang"
    ],
    "categories": [
      "cs.AI"
    ],
    "comment": "This research is also submitted to OpenReview. The main text is 9   pages (excluding citations), 7 figures, and 1 table",
    "summary": "- 大規模言語モデルにおける忖度問題を合成データ介入技術で解決\n- モデルの忖度傾向を抑えるため、多様なデータ生成の実験を設計\n- GPT4oを用い、合成データ介入されたモデルと未訓練モデルを比較\n- 合成データ介入が精度と忖度率の改善に効果的と実験結果で示された\n\nこれから大規模言語モデルも、しっかりとした合成データでトレーニングされる時代が来るのかも。プログラムも公開されてるみたいで、自分でも試してみたいなあ！",
    "topics": [
      "合成データ"
    ],
    "published": "2024-11-15T12:59:46+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.10132",
    "title": "Omnichain Web: The Universal Framework for Streamlined Chain Abstraction and Cross-Layer Interaction",
    "japanese_title": "オムニチェインウェブ: チェーン抽象化とクロスレイヤーインタラクションのためのユニバーサルフレームワーク",
    "authors": [
      "Hardik Gajera",
      "Akhil Reddy",
      "Bhagath Reddy"
    ],
    "categories": [
      "cs.CR"
    ],
    "comment": "",
    "summary": "- 現在のWeb3は、L1とL2のブロックチェーンの断片的な流動性と限られた相互運用性により効率低下\n- Omnichain Webは、OmniRollups以下のコアコンポーネントで分散ネットワークを統一するフレームワークを導入\n- このエコシステムによりシームレスなクロスチェーン資産決済とdApp開発が可能になり、流動管理を効率化\n- Web2とWeb3をつなぐ革命的なソリューションとしてデジタル経済を包括的かつ相互接続的に構築\n\nタイトルからして壮大な感じ！FutureのWeb3がもっとつながって、すごく便利な時代が来そうだよね！新しい技術で、Web2とWeb3の境目がなくなるってことなんだね、ワクワクする～！",
    "topics": [
      "ゼロ知識証明",
      "TEE"
    ],
    "published": "2024-11-15T12:06:00+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.10071",
    "title": "Evidential Federated Learning for Skin Lesion Image Classification",
    "japanese_title": "皮膚病変画像分類のための証拠に基づく連合学習",
    "authors": [
      "Rutger Hendrix",
      "Federica Proietto Salanitri",
      "Concetto Spampinato",
      "Simone Palazzo",
      "Ulas Bagci"
    ],
    "categories": [
      "cs.CV",
      "cs.AI",
      "cs.LG"
    ],
    "comment": "Published as a conference paper at ICPR 2024",
    "summary": "- FedEvPromptは証拠に基づくViTとプロンプトを連携、クラス証拠を最大化\n- bプロンプトとtプロンプトで視覚知識とタスク知識を導入、学習モデルを強化\n- 共有データは注意マップで行い、プライバシーが従来より強化される\n- 実験結果では、データ不均衡やプライバシー問題に優れた性能を示す\n\nプライバシーを守りつつ学習の質を上げるってすごいね。未来の医療技術に革命を起こしそう！みんなで協力できる新しい学びの形が広がるのかなってワクワクしてきたよ。",
    "topics": [
      "連合学習"
    ],
    "published": "2024-11-15T09:34:28+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.10064",
    "title": "Adaptive Physics-Guided Neural Network",
    "japanese_title": "適応型物理誘導ニューラルネットワーク",
    "authors": [
      "David Shulman",
      "Itai Dattner"
    ],
    "categories": [
      "stat.ME",
      "cs.LG"
    ],
    "comment": "",
    "summary": "- 物理法則と深層学習を統合し、画像データから品質属性を予測するフレームワークを提案\n- 物理情報とデータ駆動の予測を動的に調整し、複数環境でのモデル精度と堅牢性を向上\n- 合成データとして拡散方程式などを用い、比類ない物理プロセスを模倣した複雑な画像生成\n- 高環境可変性の実世界データセットで、APGNNが伝統モデルを超えた性能を示し、適応性を発揮\n\nこの研究って、物理の法則を上手く活用してAIをもっと賢くしてるんだね！特にむずかしい環境でも使えそうだから、色んな分野で役立ちそうでワクワクするよね！",
    "topics": [
      "合成データ"
    ],
    "published": "2024-11-15T09:28:55+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.09945",
    "title": "TEESlice: Protecting Sensitive Neural Network Models in Trusted Execution Environments When Attackers have Pre-Trained Models",
    "japanese_title": "TEESlice: プリトレーニングされたモデルを持つ攻撃者から信頼実行環境で機密ニューラルネットワークモデルを保護する技術",
    "authors": [
      "Ding Li",
      "Ziqi Zhang",
      "Mengyu Yao",
      "Yifeng Cai",
      "Yao Guo",
      "Xiangqun Chen"
    ],
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "comment": "Accepted by TOSEM. Extended version of the S&P24 paper   (arXiv:2310.07152)",
    "summary": "- 信頼実行環境(TEE)はデバイス上のモデルを保護するが、計算速度が限られているためDNN全体を保護するのは難しい。\n- GPUを利用して計算速度を向上できるが、一般的な商用GPUはセキュリティ保護が不足している。\n- TSDPはTEE内で機密の重みを保護し、無関係な重みをGPUにオフロードするが、情報を持った攻撃者を考慮していない。\n- 新たな方法で、トレーニング前の戦略的分割を用いることで、モデル全体の保護を実現しながら計算コストを10分の1に削減した。\n\n信頼できる環境で重みを分けるアイデア、すごいね！これで大規模な言語モデルも軽く強く保護できるって、SIGMA技術の進化を感じる～🌟！",
    "topics": [
      "TEE"
    ],
    "published": "2024-11-15T04:52:11+00:00"
  },
  {
    "url": "http://arxiv.org/abs/2411.09842",
    "title": "FedRewind: Rewinding Continual Model Exchange for Decentralized Federated Learning",
    "japanese_title": "FedRewind: 分散型連合学習のための継続的モデル交換の巻き戻し",
    "authors": [
      "Luca Palazzo",
      "Matteo Pennisi",
      "Federica Proietto Salanitri",
      "Giovanni Bellitto",
      "Simone Palazzo",
      "Concetto Spampinato"
    ],
    "categories": [
      "cs.LG"
    ],
    "comment": "",
    "summary": "- FedRewindはデータ分布シフトの問題を解決するためのモデル交換技術を提案\n- 連合学習の分散学習に伴う空間的な課題を継続学習と脳神経科学理論を基に改善\n- ローカルトレーニング中にモデルを巻き戻し式に送信し分布シフトを減少させる\n- 複数のベンチマークで標準的な手法より優位性を示し連合継続学習課題も克服\n\nなんか面白そう！連合学習に継続学習を組み合わせて難しい課題に挑むなんて、未来のAIがもっと賢くなりそうだね。こんな技術が進んだら、色々な場所で役立つAIがたくさん登場しそうでワクワクするなぁ！",
    "topics": [
      "連合学習"
    ],
    "published": "2024-11-14T23:14:43+00:00"
  }
]